esp-arduino-libs/ESP32_Display_Panel/test_apps/lvgl_port/sdkconfig.ci.waveshare_esp32_s3_touch_lcd_2_1
CONFIG_IDF_TARGET="esp32s3"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_BOARD_MANUFACTURER_ALL=y
CONFIG_BOARD_WAVESHARE_ESP32_S3_Touch_LCD_2_1=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Enable the XIP-PSRAM feature, so the ext-mem cache won't be disabled when SPI1 is operating the main flash
# For v5.2 and below
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
# For v5.3 and above
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# Used in conjunction with "RGB Bounce Buffer"
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_LVGL_PORT_AVOID_TEARING_MODE_3=y
